
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>හැඳින්වීම · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ONPYTHON.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    හැඳින්වීම
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ONPYTHON.html">
            
                <a href="ONPYTHON.html">
            
                    
                    Python ගැන
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="INSTALL.html">
            
                <a href="INSTALL.html">
            
                    
                    Python install කිරීම
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >හැඳින්වීම</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="python-&#xDC3;&#xDBB;&#xDBD;&#xDC0;">Python &#xDC3;&#xDBB;&#xDBD;&#xDC0;</h1>
<h2 id="&#xDC4;&#xDD0;&#xDB3;&#xDD2;&#xDB1;&#xDCA;&#xDC0;&#xDD3;&#xDB8;">&#xDC4;&#xDD0;&#xDB3;&#xDD2;&#xDB1;&#xDCA;&#xDC0;&#xDD3;&#xDB8;</h2>
<p>&#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xDBD;&#xDD2;&#xDBA;&#xDD0;&#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; python &#xD9C;&#xDD0;&#xDB1; &#xD9A;&#xDD2;&#xDC3;&#xDD2;&#xDB8; &#xDAF;&#xDD9;&#xDBA;&#xD9A;&#xDCA; &#xDAF;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD0;&#xDAD;&#xDD2;, &#xD9A;&#xDBD;&#xDD2;&#xDB1;&#xDCA; &#xD9A;&#xDC0;&#xDAF;&#xDCF;&#xDC0;&#xDAD;&#xDCA; programming &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDB1;&#xDD0;&#xDAD;&#xDD2; &#xD85;&#xDBA; &#xDC0;&#xDD9;&#xDB1;&#xDD4;&#xDC0;&#xDD9;&#xDB1;&#xDCA;. &#xD92; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; programming &#xDC0;&#xDBD;&#xDA7; &#xDC3;&#xDB8;&#xDCA;&#xDB4;&#xDD6;&#xDBB;&#xDCA;&#xDAB;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB8; &#xD85;&#xDBD;&#xDD4;&#xDAD;&#xDCA; &#xD85;&#xDBA;&#xDA7;. &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD;&#xDDA; &#xD9A;&#xDBB;&#xDD4;&#xDAB;&#xDD4; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xDAD;&#xDBB;&#xDB8;&#xDCA; &#xDC3;&#xDBB;&#xDBD;&#xDC0; &#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB8;&#xDB8; &#xD8B;&#xDAD;&#xDCA;&#xDC3;&#xDC4; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1;&#xDB8;&#xDCA;. &#xD9A;&#xDDC;&#xDC4;&#xDDC;&#xDB8;&#xDC0;&#xDD4;&#xDB1;&#xDAD;&#xDCA; programming &#xD89;&#xD9C;&#xDD9;&#xDB1; &#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xD91;&#xD9A; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBA;&#xDBA;&#xDD2;, &#xD92; &#xDAD;&#xDB8;&#xDBA;&#xDD2; &#xD85;&#xDB1;&#xDD2;&#xDAD;&#xDCA; &#xD85;&#xDBA;&#xD9C;&#xDD9; codes &#xD9A;&#xDD2;&#xDBA;&#xDD0;&#xDC0;&#xDD3;&#xDB8;&#xDBA;&#xDD2;, &#xDAD;&#xDB8;&#xDB1;&#xDCA; &#xDAD;&#xDB1;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA; codes &#xDBD;&#xDD2;&#xDC0;&#xDD3;&#xDB8;&#xDBA;&#xDD2;. &#xD92; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDB8;&#xDDA;&#xD9A; &#xDB4;&#xDDC;&#xDAD; &#xD9A;&#xDD2;&#xDBA;&#xDD9;&#xDC0;&#xDCA;&#xDC0; &#xDB4;&#xDB8;&#xDAB;&#xDD2;&#xDB1;&#xDCA; &#xD94;&#xDBA;&#xDCF;&#xDA7; programming &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xDC0;&#xDD9;&#xDB1; &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB1;&#xDD1;, &#xD94;&#xDBA;&#xDCF; <strong>&#xDAD;&#xDB1;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;</strong> programs &#xDBD;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDAD;&#xDCA; &#xD95;&#xDB1;&#xDD9;. &#xD92; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1; &#xD85;&#xDAD;&#xDBB;&#xDD9; &#xDB8;&#xDDA;&#xD9A;&#xDD9; &#xD91;&#xDB1; &#xD8B;&#xDAF;&#xDCF;&#xDC4;&#xDBB;&#xDAB; &#xD94;&#xDBA;&#xDCF; &#xD8B;&#xDAD;&#xDCA;&#xDC3;&#xDC4; &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDB6;&#xDBD;&#xDB1;&#xDCA;&#xDB1; &#xD95;&#xDB1;&#xDD9;. <em>&#xDC4;&#xDD0;&#xDB6;&#xDD0;&#xDBA;&#xDD2; &#xDB8;&#xDDA;&#xD9A;&#xDD9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; codes copy/paste &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xD91;&#xDB4;&#xDCF;. &#xD92; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDDA; &#xDC4;&#xDBB;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB1;&#xDD1;.</em></p>
<p>&#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD;&#xDDA; &#xD8B;&#xDAF;&#xDCF;&#xDC4;&#xDBB;&#xDAB; &#xDC0;&#xDBD;&#xDA7; &#xDB8;&#xDB8; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1;&#xDDA; <code>Python 3</code> &#xDC3;&#xD82;&#xDC3;&#xDCA;&#xD9A;&#xDBB;&#xDAB;&#xDBA;. &#xD92; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDB8;&#xDDA; &#xD8B;&#xDAF;&#xDCF;&#xDC4;&#xDBB;&#xDAB; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; <code>Python 2</code> &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xDC0;&#xDD0;&#xDA9; &#xDB1;&#xDDC;&#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xDC4;&#xDBB;&#xDD2;&#xDBA;&#xDA7;&#xDB8; &#xD9A;&#xDD2;&#xDC0;&#xDCA;&#xDC0;&#xDDC;&#xDAD;&#xDCA; &#xDB8;&#xDB8; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1;&#xDDA; <code>Python 3.5.2</code> &#xDC3;&#xD82;&#xDC3;&#xDCA;&#xD9A;&#xDBB;&#xDAB;&#xDBA;.</p>
<h2 id="&#xDB4;&#xDDC;&#xDAD;&#xDDA;-&#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2;-&#xDC0;&#xDD9;&#xDB1;-&#xDBB;&#xDA7;&#xDCF;">&#xDB4;&#xDDC;&#xDAD;&#xDDA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xDC0;&#xDD9;&#xDB1; &#xDBB;&#xDA7;&#xDCF;</h2>
<p>&#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xDBD;&#xDD2;&#xDBA;&#xDAF;&#xDCA;&#xDAF;&#xDD2; &#xDB8;&#xDB8; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB4;&#xDD4; &#xDC0;&#xDCF;&#xD9A;&#xDCA;&#x200D;&#xDBA; &#xDBB;&#xDA7;&#xDCF; &#xD9A;&#xDD2;&#xDC4;&#xDD2;&#xDB4;&#xDBA;&#xD9A;&#xDCA; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;. &#xD92; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; codes, outputs, inputs &#xDC0;&#xD9C;&#xDDA; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; &#xDB4;&#xDDC;&#xDAD;&#xDDA; &#xD85;&#xDB1;&#xDD2;&#xDAD;&#xDCA; &#xD9A;&#xDDC;&#xDA7;&#xDC3;&#xDCA; &#xDC0;&#xDBD;&#xDD2;&#xDB1;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA; &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xD85;&#xDB3;&#xDD4;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDBD;&#xDDA;&#xDC3;&#xDD2; &#xDC0;&#xDD9;&#xDB1; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8; &#xD9A;&#xDD2;&#xDC4;&#xDD2;&#xDB4;&#xDBA;&#xD9A;&#xDCA;. </p>
<p>&#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD;&#xDDA; &#xDB8;&#xDDA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7;,</p>
<pre><code class="lang-python"><span class="hljs-comment"># prints a greeting</span>
print(<span class="hljs-string">&quot;Hello, World!&quot;</span>)
</code></pre>
<p>&#xDBA;&#xDB8;&#xDCA; &#xD9A;&#xDDC;&#xDA7;&#xDC3;&#xD9A;&#xDCA; &#xDBD;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA;, &#xD92; &#xDBD;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; python codes. &#xDB8;&#xDDA; &#xD9A;&#xDDC;&#xDA7;&#xDC3;&#xD9A; &#xD85;&#xDB1;&#xDCA;&#xDAD;&#xDBB;&#xDCA;&#xD9C;&#xDAD;&#xDBA; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xD91;&#xD9A; &#xD91;&#xD9A; &#xDB4;&#xDCF;&#xDA7; &#xDC0;&#xDBD;&#xDD2;&#xDB1;&#xDCA; &#xDAF;&#xDD0;&#xD9A;&#xDCA;&#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xD91;&#xDC4;&#xDD9;&#xDB8; &#xDB4;&#xDCF;&#xDA7; &#xDB4;&#xDCF;&#xDA7;&#xDD2;&#xDB1;&#xDCA; &#xDAF;&#xDD0;&#xD9A;&#xDCA;&#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1;&#xDCA;&#xDB1; &#xDBD;&#xDDA;&#xDC3;&#xDD2; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;. &#xDC4;&#xDD0;&#xDB6;&#xDD0;&#xDBA;&#xDD2; &#xDB8;&#xDDA;&#xDC0;&#xDCF; &#xD94;&#xDBA;&#xDCF; text editor &#xD91;&#xD9A;&#xD9A; (notepad, gedit) type &#xD9A;&#xDBB;&#xDB1; &#xD9A;&#xDDC;&#xDA7; &#xDB8;&#xDDA; &#xDC0;&#xD9C;&#xDDA; &#xDB4;&#xDCF;&#xDA7; &#xDB1;&#xDDC;&#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xD92;&#xD9A; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDC1;&#xDCA;&#xDB1;&#xDBA;&#xD9A;&#xDCA; &#xDB1;&#xDD9;&#xDB8;&#xDD9;&#xDBA;&#xDD2; &#xDC0;&#xDD0;&#xDAF;&#xD9C;&#xDAD;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; code &#xD91;&#xD9A; &#xDC4;&#xDBB;&#xDD2;&#xDBA;&#xDA7; &#xDBD;&#xDD2;&#xDC0;&#xDD3;&#xDB8;&#xDBA;&#xDD2;, &#xDB4;&#xDCF;&#xDA7; &#xDC0;&#xDD0;&#xDAF;&#xD9C;&#xDAD;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD1;. </p>
<p>computer &#xD91;&#xD9A;&#xDDA; output &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDBD;&#xDD2;&#xDBA;&#xDB1; &#xD9A;&#xDDC;&#xDA7; &#xDB8;&#xDB8; &#xDB8;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB8;&#xDDA; &#xDC0;&#xD9C;&#xDDA; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBA;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;.</p>
<pre><code>Hello, World!
</code></pre><p>&#xD9A;&#xDBD;&#xDD2;&#xDB1;&#xDCA; &#xD9A;&#xDDC;&#xDA7;&#xDC3;&#xDD9; &#xDC0;&#xD9C;&#xDDA;&#xDB8;&#xDBA;&#xDD2; &#xDC4;&#xDD0;&#xDB6;&#xDD0;&#xDBA;&#xDD2; &#xDB8;&#xDD9;&#xDAD;&#xDD0;&#xDB1;&#xDAF;&#xDD2; &#xD9A;&#xDD2;&#xDC3;&#xDD2;&#xDB8; &#xDB4;&#xDCF;&#xDA7; &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;&#xD9A;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB1;&#xDD1;.</p>
<p>&#xD92; &#xDC0;&#xD9C;&#xDDA;&#xDB8; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xD85;&#xDB4;&#xDD2; &#xDBD;&#xDD2;&#xDBA;&#xDB1; program &#xD91;&#xD9A;&#xD9A;&#xDA7; input &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDAF;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xD85;&#xDB4;&#xDD2;&#xDA7; &#xDC3;&#xDD2;&#xDAF;&#xDCA;&#xDB0; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xD92; &#xDC0;&#xD9C;&#xDDA; &#xDC0;&#xDD9;&#xDBD;&#xDCF;&#xDC0;&#xDA7; &#xDB8;&#xDB8; &#xDB8;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB8;&#xDDA; &#xDC0;&#xD9C;&#xDDA; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBA;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;,</p>
<pre>
Input your name: <b>User</b>
Welcome, User
</pre>

<p>&#xDB8;&#xDD9;&#xDAD;&#xDD0;&#xDB1;&#xDAF;&#xDD2; <strong>&#xDAD;&#xDAF; &#xD9A;&#xDC5;&#xDD4;</strong> &#xD85;&#xD9A;&#xDD4;&#xDBB;&#xDD2;&#xDB1;&#xDCA; &#xDBD;&#xDD2;&#xDBA;&#xDBD; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xD85;&#xDB4;&#xDD2; type &#xD9A;&#xDBB;&#xDB4;&#xDD4; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA;. &#xD85;&#xDB1;&#xDD2;&#xDAD;&#xDCA; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; computer &#xD91;&#xD9A;&#xDDA; outputs.</p>
<p>&#xD92; &#xDC0;&#xD9C;&#xDDA;&#xDB8; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xDBD;&#xDD2;&#xDBA;&#xDAF;&#xDCA;&#xDAF;&#xDD2; terminal (command prompt, <code>cmd</code>) &#xD91;&#xD9A;&#xDDA; commands &#xDAF;&#xDD9;&#xDB1; &#xD85;&#xDC0;&#xDC3;&#xDCA;&#xDAE;&#xDCF; &#xDB8;&#xDA7; &#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD9;&#xDB1;&#xDC0;&#xDCF;. &#xD92; &#xDC0;&#xD9C;&#xDDA; &#xD85;&#xDC0;&#xDC3;&#xDCA;&#xDAE;&#xDCF; &#xDC0;&#xDBD; &#xDB8;&#xDB8; &#xDB8;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB8;&#xDDA; &#xDC0;&#xD9C;&#xDDA; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBA;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;.</p>
<pre>
$ cd Python-3.6.0/
$ ./configure --prefix=$HOME/py3
<i>... &#xDAF;&#xDD2;&#xD9C; output &#xD91;&#xD9A;&#xD9A;&#xDCA; ...</i>
</pre>

<p>&#xDB8;&#xDD9;&#xDAD;&#xDD0;&#xDB1; <strong>$</strong> &#xDBD;&#xD9A;&#xDD4;&#xDAB;&#xDD2;&#xDB1;&#xDCA; &#xDAF;&#xDD0;&#xD9A;&#xDCA;&#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; prompt &#xD91;&#xD9A;. prompt &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xDB4;&#xDDA;&#xDBD;&#xDD2;&#xDBA;&#xDD9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; &#xDC0;&#xDD2;&#xDAD;&#xDBB;&#xDBA;&#xDD2; &#xD95;&#xD9C;&#xDDC;&#xDBD;&#xDCA;&#xDBD;&#xDDC; terminal (<code>cmd</code>) &#xD91;&#xD9A;&#xDDA; &#xDAF;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xD95;&#xDB1;&#xDD9;. prompt &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB1;&#xDD0;&#xDAD;&#xDD2; &#xDB4;&#xDDA;&#xDC5;&#xDD2; &#xDC0;&#xDBD; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; command &#xD91;&#xD9A;&#xDDA; outputs &#xD91;&#xD9A;. 
&#xDB8;&#xDD9;&#xDAD;&#xDD0;&#xDB1; &#xDB8;&#xDB8; &#xDAD;&#xDC0;&#xDAD;&#xDCA; &#xDAF;&#xDD9;&#xDBA;&#xD9A;&#xDCA; &#xDAF;&#xD9A;&#xDCA;&#xDC0;&#xDBD; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;. &#xD8B;&#xDA9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xD9A;&#xDDC;&#xDA7;&#xDC3;&#xDD9; <em>&#xD87;&#xDBD; &#xD85;&#xD9A;&#xDD4;&#xDBB;&#xDD2;&#xDB1;&#xDCA;</em> &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA;( <i><code>... &#xDAF;&#xDD2;&#xD9C; output &#xD91;&#xD9A;&#xD9A;&#xDCA; ...</code></i> &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xD9A;&#xDDC;&#xDA7;&#xDC3;) &#xDB8;&#xDB8; &#xDBD;&#xDD2;&#xDBA;&#xDB1; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA;, &#xD92;&#xDC0;&#xDCF; &#xD9A;&#xDD2;&#xDC3;&#xDD2;&#xDB8; command &#xD91;&#xD9A;&#xD9A;, program &#xD91;&#xD9A;&#xD9A; output &#xD91;&#xD9A;&#xD9A;&#xDCA;, input &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB1;&#xDD9;&#xDB8;&#xDD9;&#xDBA;&#xDD2;. &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; &#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB8;&#xDB8; &#xD91;&#xD9A;&#xDAD;&#xDD4; &#xD9A;&#xDBB;&#xDB4;&#xDD4; &#xDC0;&#xDCF;&#xD9A;&#xDCA;&#x200D;&#xDBA; &#xDAD;&#xDB8;&#xDBA;&#xDD2; &#xD92; <em>&#xD87;&#xDBD; &#xD85;&#xD9A;&#xDD4;&#xDBB;&#xDD2;&#xDB1;&#xDCA;</em> &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA;.</p>
<h2 id="&#xDB4;&#xDDC;&#xDAD;-&#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1;&#xDCA;&#xDB1;-&#xD95;&#xDB1;&#xDD9;-&#xD9A;&#xDBB;&#xDB1;-&#xDB4;&#xDD9;&#xDBB;-&#xDAF;&#xDD0;&#xDB1;&#xDD4;&#xDB8;">&#xDB4;&#xDDC;&#xDAD; &#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1;&#xDCA;&#xDB1; &#xD95;&#xDB1;&#xDD9; &#xD9A;&#xDBB;&#xDB1; &#xDB4;&#xDD9;&#xDBB; &#xDAF;&#xDD0;&#xDB1;&#xDD4;&#xDB8;</h2>
<p>&#xDB8;&#xDB8; &#xDB8;&#xDD4;&#xDBD;&#xDD2;&#xDB1;&#xDCA;&#xDB8; &#xD9A;&#xDD2;&#xDC0;&#xDCA;&#xDC0;&#xDCF; &#xDC0;&#xD9C;&#xDDA; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xDBD;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1; programming &#xDC0;&#xDBD;&#xDA7; &#xDC3;&#xDB8;&#xDCA;&#xDB4;&#xDD6;&#xDBB;&#xDCA;&#xDAB;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB8; &#xD85;&#xDBD;&#xDD4;&#xDAD;&#xDCA; &#xD85;&#xDBA;&#xDA7;, programming &#xDB4;&#xDA7;&#xDB1;&#xDCA; &#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDAD;&#xDD0;&#xDB1;&#xD9A;&#xDCA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7;. &#xD92; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD;&#xDDA;&#xDAF;&#xDD2; &#xDB8;&#xDB8; programming &#xD9C;&#xDD0;&#xDB1; &#xDC3;&#xD82;&#xD9A;&#xDD3;&#xDBB;&#xDCA;&#xDAB; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; &#xD9A;&#xDAD;&#xDCF; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD1;. &#xD92;&#xD9A; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1; &#xD9A;&#xDD9;&#xDB1;&#xDCF;&#xDA7; &#xDB4;&#xDC4;&#xDC3;&#xDD4;&#xDC0;&#xD9A;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDAD;&#xDCA; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;, &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xD85;&#xDB4;&#xDC4;&#xDC3;&#xDD4;&#xDC0;&#xD9A;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDAD;&#xDCA; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xD8B;&#xDAF;&#xDCF;&#xDC4;&#xDBB;&#xDAB;&#xDBA;&#xD9A;&#xDCA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7; &#xDB8;&#xDB8; &#xD8A;&#xDBD;&#xD9F; &#xDB4;&#xDBB;&#xDD2;&#xDA0;&#xDCA;&#xDA1;&#xDDA;&#xDAF;&#xDD9;&#xDAF;&#xDD2; python &#xD9C;&#xDD0;&#xDB1; &#xD9A;&#xDAD;&#xDCF; &#xD9A;&#xDBB;&#xDAF;&#xDCA;&#xDAF;&#xDD2; &#xDB8;&#xDDA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7; &#xDC3;&#xDB3;&#xDC4;&#xDB1;&#xDCA; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;,</p>
<blockquote>
<p>Python &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDD2;&#xDAD; (interpreted) &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBD;&#xDDA;&#xD9B;&#xDB1; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;&#xD9A;&#xDCA;. &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBD;&#xDDA;&#xD9B;&#xDB1; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDAD;&#xDB8;&#xDBA;&#xDD2; &#xD85;&#xDB4;&#xDD2; &#xDB4;&#xDBB;&#xDD2;&#xD9C;&#xDAB;&#xD9A;&#xDBA;&#xDA7; &#xDBA;&#xDB8;&#xDCA; &#xD9A;&#xDCF;&#xDBB;&#xDCA;&#xDBA;&#xDBA;&#xD9A;&#xDCA; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xD8B;&#xDB4;&#xDAF;&#xDD9;&#xDC3;&#xDCA; &#xDAF;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; ....</p>
</blockquote>
<p>&#xDB8;&#xDDA;&#xDAD;&#xDD0;&#xDB1;&#xDAF;&#xDD2; &#xDB8;&#xDB8; <em>&#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBD;&#xDDA;&#xD9B;&#xDB1; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;</em> &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xDAF;&#xDDA; &#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xD9A;&#xDBD;&#xDAD;&#xDCA; <em>&#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDD2;&#xDAD;</em> &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xDC0;&#xDA0;&#xDB1;&#xDD9;, &quot;&#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDAD;&#xDD2;&#xDAD; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA;...&quot; &#xD9A;&#xDD2;&#xDBA;&#xDBD; &#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB1;&#xDD1;, &#xDB8;&#xDDC;&#xD9A;&#xDAF; &#xD91;&#xDC4;&#xDD9;&#xDB8; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xD9C;&#xDD2;&#xDBA;&#xDDC;&#xDAD;&#xDCA; &#xDB8;&#xDA7; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDB0;&#xDCF;&#xDB1; &#xD9A;&#xDCF;&#xDBB;&#xDAB;&#xDCF;&#xDC0;&#xDD9;&#xDB1;&#xDCA; &#xDB6;&#xDD0;&#xDC4;&#xDD0;&#xDBB;&#xDC0; &#xD9C;&#xDDC;&#xDA9;&#xD9A;&#xDCA; &#xDAF;&#xDD4;&#xDBB; &#xDBA;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD9;&#xDB1; &#xDB1;&#xDD2;&#xDC3;&#xDCF;. &#xD92; &#xDC0;&#xDD9;&#xDB1;&#xDD4;&#xDC0;&#xDA7; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xD92; &#xD9C;&#xDD0;&#xDB1; &#xDAF;&#xDBD; &#xD85;&#xDAF;&#xDC4;&#xDC3;&#xD9A;&#xDCA; &#xD8A;&#xDBD;&#xD9F; &#xDA1;&#xDDA;&#xDAF; &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1; &#xD89;&#xDA9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;, &#xD91;&#xDC4;&#xDD9;&#xDB8;&#xDAD;&#xDCA; &#xDB1;&#xDD0;&#xDAD;&#xDCA;&#xDB1;&#xDB8;&#xDCA; &#xD92; &#xD9C;&#xDD0;&#xDB1; &#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xDB1;&#xDDC;&#xD9A;&#xDBB; &#xD89;&#xDC3;&#xDCA;&#xDC3;&#xDBB;&#xDC4;&#xDA7; &#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDAD;&#xDCA; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; (&#xDB4;&#xDD0;&#xDC4;&#xDD0;&#xDAF;&#xDD2;&#xDBD;&#xDD2; &#xDB1;&#xDDC;&#xD9A;&#xDC5;&#xDCF; &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xD92;&#xD9A;&#xDD9;&#xDB1;&#xDCA; python &#xDB4;&#xDD2;&#xDC5;&#xDD2;&#xDB6;&#xDB3; &#xDAF;&#xDD0;&#xDB1;&#xDD4;&#xDB8;&#xDA7; &#xDC4;&#xDCF;&#xDB1;&#xDD2;&#xDBA;&#xD9A;&#xDCA; &#xDC0;&#xDD9;&#xDB1; &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB1;&#xDD1;).</p>
<p>&#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1;&#xDCA;&#xDB1;, &#xDAD;&#xDDA;&#xDBB;&#xDD4;&#xDB8;&#xDCA; &#xD9C;&#xDB1;&#xDCA;&#xDB1; programming &#xD9C;&#xDD0;&#xDB1; &#xDAF;&#xDD0;&#xDB1;&#xDD4;&#xDB8;&#xD9A;&#xDCA; &#xD95;&#xDB1;&#xDD9; &#xDB1;&#xDD0;&#xDAD;&#xDD2; &#xDC0;&#xDD4;&#xDB1;&#xDAD;&#xDCA;, computer &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDBA;&#xDB8;&#xDCA; &#xDB4;&#xDD4;&#xDBB;&#xDD4;&#xDAF;&#xDCA;&#xDAF;&#xD9A;&#xDCA; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA; &#xDC4;&#xDDC;&#xDB3;&#xDBA;&#xDD2;. text editor<sup><a href="#fn_1" id="reffn_1">1</a></sup> &#xD91;&#xD9A;&#xD9A; text &#xD91;&#xD9A;&#xD9A;&#xDCA; type &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xD92;&#xD9A; &#xD85;&#xDC0;&#xDC1;&#xDCA;&#x200D;&#xDBA; extension<sup><a href="#fn_2" id="reffn_2">2</a></sup> &#xD91;&#xD9A;&#xDAD;&#xDCA; &#xD91;&#xD9A;&#xDCA;&#xD9A; save &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xDB1;&#xDB8;&#xDCA; &#xD92; &#xDAF;&#xDD0;&#xDB1;&#xDD4;&#xDB8; &#xD9C;&#xDDC;&#xDA9;&#xD9A;&#xDCA; &#xDAF;&#xDD4;&#xDBB;&#xDA7; &#xDC3;&#xDD1;&#xDC4;&#xDD9;&#xDB1;&#xDC0;&#xDCF;.</p>
<h2 id="&#xD8B;&#xDAF;&#xDC0;&#xDCA;-&#xD85;&#xDBB;&#xD9C;&#xDD0;&#xDB1;&#xDD3;&#xDB8;">&#xD8B;&#xDAF;&#xDC0;&#xDCA; &#xD85;&#xDBB;&#xD9C;&#xDD0;&#xDB1;&#xDD3;&#xDB8;</h2>
<p>programming &#xD89;&#xD9C;&#xDD9;&#xDB1; &#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xD9A;&#xDDC;&#xDA7; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xD85;&#xDC0;&#xDC3;&#xDCA;&#xDAE;&#xDCF; &#xDC0;&#xDBD; &#xD9C;&#xDD0;&#xDA7;&#xDC5;&#xDD4; &#xDB8;&#xDAD;&#xDD4;&#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; (&#xD85;&#xDB1;&#xDD2;&#xDAD;&#xDCA; &#xD95;&#xDB1;&#xDD9;&#xDB8; &#xDC0;&#xDD2;&#xDC2;&#xDBA;&#xD9A;&#xDAF;&#xDD2; &#xDC0;&#xD9C;&#xDDA;&#xDB8;). &#xD92; &#xDC0;&#xD9C;&#xDDA; &#xD85;&#xDC0;&#xDC3;&#xDCA;&#xDAE;&#xDCF; &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xD85;&#xDB4;&#xDD2;&#xDA7; &#xD95;&#xDB1;&#xDD9; &#xDB1;&#xDB8;&#xDCA; internet &#xD91;&#xD9A;&#xDDA; &#xD92; &#xD9C;&#xDD0;&#xDB1; &#xDC4;&#xDDC;&#xDBA;&#xDBD;&#xDCF; &#xDB6;&#xDBD;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xD92; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7;&#xDAD;&#xDCA; &#xDC4;&#xDDC;&#xDBA;&#xDCF; &#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB6;&#xDD0;&#xDBB;&#xDD2;&#xDC0;&#xDD4;&#xDB1;&#xDDC;&#xDAD;&#xDCA; &#xDAF;&#xDB1;&#xDCA;&#xDB1; &#xD9A;&#xDD9;&#xDB1;&#xDD9;&#xD9A;&#xDCA; &#xD9C;&#xDD9;&#xDB1;&#xDCA; &#xD85;&#xDC4;&#xDBD; &#xDB6;&#xDBD;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. python &#xDAF;&#xDB1;&#xDCA;&#xDB1; &#xD85;&#xDBA; facebook groups &#xDC0;&#xDBD; forums &#xDC0;&#xDBD; &#xD89;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xD92; &#xDC0;&#xD9C;&#xDDA; &#xD85;&#xDC0;&#xDC3;&#xDCA;&#xDAE;&#xDCF; &#xDC0;&#xDBD;&#xDAF;&#xDD2; <a href="http://synkoda.com" target="_blank">synkoda</a> forum &#xD91;&#xD9A;&#xDDA; &#xD8B;&#xDAD;&#xDCA;&#xDC3;&#xDC4; &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDB6;&#xDBD;&#xDB1;&#xDCA;&#xDB1; &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDB8;&#xDB8; &#xD86;&#xDBB;&#xDCF;&#xDB0;&#xDB1;&#xDCF; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;. Synkoda forum &#xD91;&#xD9A;&#xDDA; &#xD85;&#xDC4;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA; file &#xD91;&#xD9A;&#xD9A;&#xDCA; save &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDC4;&#xDD0;&#xDA7;&#xDD2; &#xD89;&#xDB3;&#xDB1;&#xDCA; &#xD95;&#xDB1;&#xDD9;&#xDB8; &#xDAF;&#xDD9;&#xDBA;&#xD9A;&#xDCA; &#xD9C;&#xDD0;&#xDB1; &#xD85;&#xDC4;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;.</p>
<h2 id="&#xDB4;&#xDDC;&#xDAD;-&#xDBD;&#xDD2;&#xDC0;&#xDD3;&#xDB8;">&#xDB4;&#xDDC;&#xDAD; &#xDBD;&#xDD2;&#xDC0;&#xDD3;&#xDB8;</h2>
<p>&#xDB8;&#xDB8; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xDBD;&#xDD2;&#xDC0;&#xDCA;&#xDC0;&#xDD9; Markdown &#xDC0;&#xDBD;&#xDD2;&#xDB1;&#xDCA; Gitbook &#xD8B;&#xDAF;&#xDC0;&#xDCA; &#xD9A;&#xDBB;&#xD9C;&#xDD9;&#xDB1;. &#xD92; &#xDC0;&#xDD4;&#xDB1;&#xDAD;&#xDCA; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; XHTML, PDF &#xD86;&#xD9A;&#xDCF;&#xDBB; &#xDC0;&#xDBD;&#xDD2;&#xDB1;&#xDD4;&#xDAD;&#xDCA; &#xD85;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;.</p>
<p>&#xD92; &#xDC0;&#xD9C;&#xDDA;&#xDB8; &#xDB8;&#xDDA; &#xDB4;&#xDDC;&#xDAD; &#xD9A;&#xDD9;&#xDB1;&#xDD9;&#xD9A;&#xDCA;&#xDA7; &#xDC3;&#xD82;&#xDC3;&#xDCA;&#xD9A;&#xDBB;&#xDAB;&#xDBA; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD4;&#xDC0;&#xDB8;&#xDB1;&#xDCF; &#xDB1;&#xDB8;&#xDCA; <a href="github-repo-link">&#xDB8;&#xDD9;&#xDAD;&#xDD0;&#xDB1;&#xDD2;&#xDB1;&#xDCA;</a> &#xDB4;&#xDDC;&#xDAD; &#xDB6;&#xDCF;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;.</p>
<hr>
<blockquote id="fn_1">
<sup>1</sup>. text editor &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xD85;&#xDB4;&#xDD2;&#xDA7; &#xDBA;&#xDB8;&#xDCA; text &#xD91;&#xD9A;&#xD9A;&#xDCA; edit &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xDC3;&#xDBB;&#xDBD; software &#xD91;&#xD9A;&#xD9A;&#xDCA;. &#xDB8;&#xDDA;&#xDC0;&#xDBA;&#xDD9; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; type &#xD9A;&#xDBB;&#xDB1; &#xD91;&#xD9A; &#xDC0;&#xDD2;&#xDAD;&#xDBB;&#xDBA;&#xDD2;. MS Word &#xDC0;&#xDBD; &#xDC0;&#xD9C;&#xDDA; &#xDB4;&#xDD2;&#xDB1;&#xDCA;&#xDAD;&#xDD6;&#xDBB; &#xDC0;&#xD9C;&#xDD4; &#xD91;&#xD9A;&#xDAD;&#xDD4; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB8;&#xDDA;&#xDC0;&#xDCF;&#xDBA;&#xDD9; &#xDB6;&#xDD1;, &#xDB1;&#xDD2;&#xD9A;&#xDB1;&#xDCA;&#xDB8; type &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8; &#xDC0;&#xDD2;&#xDAD;&#xDBB;&#xDBA;&#xDD2; (&#xDC4;&#xDD0;&#xDB6;&#xDD0;&#xDBA;&#xDD2; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xD92;&#xDC0;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF; type &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;&#xDA7; &#xD85;&#xDB8;&#xDAD;&#xDBB;&#xDC0; &#xD9C;&#xDDC;&#xDA9;&#xD9A;&#xDCA; &#xDC0;&#xDD0;&#xDA9; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xD92;&#xDC0;&#xDCF;).  Notepad (Windows), Gedit(Ubuntu), TextEdit (MacOS) &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB8;&#xDDA;&#xDC0;&#xDCF;&#xDA7; &#xD8B;&#xDAF;&#xDCF;&#xDC4;&#xDBB;&#xDAB;.<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_2">
<sup>2</sup>. extension &#xD91;&#xD9A; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; file &#xD91;&#xD9A;&#xD9A; &#xDB1;&#xDB8;&#xD9A; &#xD85;&#xDB1;&#xDCA;&#xDAD;&#xDD2;&#xDB8;&#xDA7; &#xDBA;&#xDD9;&#xDAF;&#xDD9;&#xDB1; (&#xDAD;&#xDD2;&#xDAD;&#xDA7; &#xDB4;&#xDC3;&#xDCA;&#xDC3;&#xDD9;) &#xD85;&#xD9A;&#xDD4;&#xDBB;&#xDD4; &#xD9A;&#xDD2;&#xDC4;&#xDD2;&#xDB4;&#xDBA;&#xDA7;. &#xD8B;&#xDAF;&#xDCF; <code>hello.py</code> &#xD9A;&#xDD2;&#xDBA;&#xDB1; file name &#xD91;&#xD9A;&#xDDA; extension &#xD91;&#xD9A; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; <code>py</code>. <a href="#reffn_2" title="Jump back to footnote [2] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="ONPYTHON.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Python ගැන">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"හැඳින්වීම","level":"1.1","depth":1,"next":{"title":"Python ගැන","level":"1.2","depth":1,"path":"ONPYTHON.md","ref":"ONPYTHON.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2016-12-26T05:43:52.840Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-12-26T13:50:50.464Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

