
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Python install කිරීම · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="ONPYTHON.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    හැඳින්වීම
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ONPYTHON.html">
            
                <a href="ONPYTHON.html">
            
                    
                    Python ගැන
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="INSTALL.html">
            
                <a href="INSTALL.html">
            
                    
                    Python install කිරීම
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Python install කිරීම</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="python-install-&#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;">Python install &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;</h1>
<p>Python &#xDC0;&#xDBD;&#xDD2;&#xDB1;&#xDCA; programming &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xD9A;&#xDBD;&#xDD2;&#xDB1;&#xDCA; &#xD85;&#xDB4;&#xDD2;&#xDA7; python interpreter &#xD91;&#xD9A; install &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xD95;&#xDB1;&#xDD9;. &#xD92; &#xDC0;&#xD9C;&#xDDA;&#xDB8; &#xD85;&#xDB4;&#xDD2;&#xDA7; codes &#xDBD;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1; text editor &#xD91;&#xD9A;&#xD9A;&#xDD4;&#xDAD;&#xDCA; &#xD95;&#xDB1;&#xDD9; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;. text editor &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7; &#xD85;&#xDB4;&#xDD2;&#xDA7; python &#xDC0;&#xDBD;&#xDA7;&#xDB8; &#xDC4;&#xDAF;&#xDB4;&#xDD4; IDLE editor &#xD91;&#xD9A; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. Windows &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xDB1;&#xDB8;&#xDCA; notepad &#xD91;&#xD9A;&#xDA7; &#xDC0;&#xDA9;&#xDCF; IDLE &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDB1; &#xD91;&#xD9A; &#xDC4;&#xDDC;&#xDB3;&#xDBA;&#xDD2;. Notepad &#xDC0;&#xDBD;&#xDD2;&#xDB1;&#xDCA; &#xDBD;&#xDD2;&#xDC0;&#xDCA;&#xDC0;&#xDDC;&#xDAD;&#xDCA; &#xDB4;&#xDDC;&#xDA9;&#xDD2; &#xDB4;&#xDDC;&#xDA9;&#xDD2; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDC1;&#xDCA;&#xDB1; &#xD87;&#xDAD;&#xDD2; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1; &#xD89;&#xDA9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;.</p>
<h2 id="windows-&#xDC0;&#xDBD;&#xDA7;-python-install-&#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;">Windows &#xDC0;&#xDBD;&#xDA7; python install &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;</h2>
<p>Windows &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xDC3;&#xDCF;&#xDB8;&#xDCF;&#xDB1;&#xDCA;&#x200D;&#xDBA; program &#xD91;&#xD9A;&#xD9A;&#xDCA; install &#xD9A;&#xDBB;&#xDB1; &#xDB4;&#xDD2;&#xDBD;&#xDD2;&#xDC0;&#xDD9;&#xDBD;&#xDA7;&#xDB8; python interpreter &#xD91;&#xD9A; install &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xDB8;&#xDD4;&#xDBD;&#xDD2;&#xDB1;&#xDCA;&#xDB8; &#xDAD;&#xDB8;&#xDB1;&#xDCA;&#xDA7; &#xD9C;&#xDD0;&#xDBD;&#xDB4;&#xDD9;&#xDB1; installer (&#xDB4;&#xDC4;&#xDBD; &#xDB6;&#xDBD;&#xDB1;&#xDCA;&#xDB1;) &#xD91;&#xD9A; <a href="https://www.python.org/downloads/release/python-360/" target="_blank">python site</a> &#xD91;&#xD9A;&#xDD9;&#xDB1;&#xDCA; download &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xD95;&#xDB1;&#xDD9;. 
&#xDB8;&#xDDA; &#xDB4;&#xDD2;&#xDA7;&#xDD4;&#xDC0;&#xDD9; download &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; installers &#xD9A;&#xDD2;&#xDC4;&#xDD2;&#xDB4;&#xDBA;&#xD9A;&#xDCA;&#xDB8; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;. &#xD92; &#xD85;&#xDAD;&#xDBB;&#xDD2;&#xDB1;&#xDCA; <code>x86</code> &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xDC0;&#xDA0;&#xDB1;&#xDD9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; 32-bit OS &#xDC0;&#xDBD;&#xDA7; &#xD9C;&#xDD0;&#xDBD;&#xDB4;&#xDD9;&#xDB1; installers &#xDC0;&#xDBD;, <code>x86-64</code> &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDDA; 64-bit OS &#xDC0;&#xDBD;&#xDA7; &#xD9C;&#xDD0;&#xDBD;&#xDB4;&#xDD9;&#xDB1; installers &#xDC0;&#xDBD;&#xDA7;. <code>web-based installer</code> &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; installer &#xD91;&#xD9A;&#xD9A;&#xDD2;&#xDB1;&#xDCA;  install &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB1;&#xDB8;&#xDCA; internet connection &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xD95;&#xDB1;&#xDD9; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF;. <code>executable installer</code> &#xD91;&#xD9A; &#xDAD;&#xDB8;&#xDBA;&#xDD2; &#xDC3;&#xDCF;&#xDB8;&#xDCF;&#xDB1;&#xDCA;&#x200D;&#xDBA; installer &#xD91;&#xD9A; (&#xDB8;&#xDDA;&#xD9A; download &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA; &#xDC4;&#xDDC;&#xDB3;&#xDBA;&#xDD2;)
&#xDB8;&#xDDA; installer &#xD91;&#xD9A; download &#xD9A;&#xDBB;&#xD9C;&#xDAD;&#xDCA;&#xDAD;&#xDA7; &#xDB4;&#xDC3;&#xDCA;&#xDC3;&#xDD9; &#xDC3;&#xDCF;&#xDB8;&#xDCF;&#xDB1;&#xDCA;&#x200D;&#xDBA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7;&#xDB8; install &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. </p>
<h2 id="linux-&#xDC3;&#xDB3;&#xDC4;&#xDCF;">Linux &#xDC3;&#xDB3;&#xDC4;&#xDCF;</h2>
<p>&#xDC4;&#xDD4;&#xD9F;&#xD9A;&#xDCA; linux &#xDB8;&#xDD9;&#xDC4;&#xDD9;&#xDBA;&#xDD4;&#xDB8;&#xDCA; &#xDB4;&#xDAF;&#xDCA;&#xDB0;&#xDAD;&#xDD2; &#xDC0;&#xDBD; python &#xD9A;&#xDBD;&#xDD2;&#xDB1;&#xDCA;&#xDB8; install &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;. &#xD92; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xD85;&#xDBD;&#xDD4;&#xDAD;&#xDD2;&#xDB1;&#xDCA; python install &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD4;&#xDC0;&#xDB8;&#xDB1;&#xDCF;&#xDC0;&#xD9A;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD1; (&#xD85;&#xDBD;&#xDD4;&#xDAD;&#xDCA; Debian, Ubuntu, Fedora &#xDC0;&#xD9C;&#xDDA; OS &#xD91;&#xD9A;&#xD9A;&#xDB1;&#xDB8;&#xDCA; python3 &#xD9A;&#xDBD;&#xDD2;&#xDB1;&#xDCA;&#xDB8; install &#xD9A;&#xDBB;&#xDBD; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDCF;). &#xDAF;&#xDD0;&#xDB1;&#xDA7;&#xDB8;&#xDAD;&#xDCA; python install &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDC0;&#xDAF; &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDB6;&#xDBD;&#xDCF;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xDB8;&#xDDA; command &#xD91;&#xD9A; terminal &#xD91;&#xD9A;&#xDDA; &#xDAF;&#xDD3;&#xDBD;&#xDCF;,</p>
<pre><code class="lang-bash">$ python3
</code></pre>
<p>&#xDB8;&#xDDA; command &#xD91;&#xD9A;&#xDD9;&#xDB1;&#xDCA; &#xDB8;&#xDDA; &#xDC0;&#xD9C;&#xDDA; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDAD;&#xDD2;&#xDB5;&#xDBD;&#xDBA;&#xD9A;&#xDCA; &#xDBD;&#xDD0;&#xDB6;&#xDD9;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA;, &#xDAF;&#xDD0;&#xDB1;&#xDA7;&#xDB8;&#xDAD;&#xDCA; python install &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9;.</p>
<pre><code>Python 3.5.2 (default, Nov 17 2016, 17:05:23) 
[GCC 5.4.0 20160609] on linux
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.
&gt;&gt;&gt;
</code></pre><p>&#xDB8;&#xDDA; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDD9; output &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB1;&#xDD0;&#xDAD;&#xDD4;&#xDC0; (&#xDB8;&#xDD9;&#xDAD;&#xDD0;&#xDB1; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xD89;&#xDBD;&#xD9A;&#xDCA;&#xD9A;&#xDB8;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDC3;&#xDCA; &#xDC0;&#xDD4;&#xDAB;&#xDCF;&#xDA7; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDC1;&#xDCA;&#xDB1;&#xDBA;&#xD9A;&#xDCA; &#xDB1;&#xDD1;) <code>command not found</code> &#xDC0;&#xD9C;&#xDDA; output &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDBD;&#xDD0;&#xDB6;&#xDD9;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA; python install &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDB1;&#xDD1;. &#xD91;&#xDC4;&#xDD9;&#xDB8; &#xDC0;&#xDD9;&#xDBD;&#xDCF;&#xDC0;&#xDA7; python install &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC4;&#xDDC;&#xDB3;&#xDB8; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBA; &#xDAD;&#xDB8;&#xDBA;&#xDD2; package manager &#xD91;&#xD9A; &#xDC4;&#xDBB;&#xDC4;&#xDCF; install &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xD91;&#xD9A;.</p>
<p>&#xD91;&#xDC4;&#xDD9;&#xDB8; &#xDB1;&#xDD0;&#xDAD;&#xDCA;&#xDB1;&#xDB8;&#xDCA; Python source &#xD91;&#xD9A; download &#xD9A;&#xDBB;&#xD9C;&#xDD9;&#xDB1; &#xD92;&#xD9A; compile &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1;&#xDAD;&#xDCA; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xDB8;&#xDD4;&#xDBD;&#xDD2;&#xDB1;&#xDCA;&#xDB8; <a href="https://www.python.org/downloads/release/python-360/" target="_blank">python site</a> &#xD91;&#xD9A;&#xDD9;&#xDB1;&#xDCA; <code>Gzipped source tarball</code> &#xDC4;&#xDBB;&#xDD2;, <code>XZ compressed source tarball</code> &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xDAF;&#xDD9;&#xD9A;&#xDD9;&#xDB1;&#xDCA; &#xD91;&#xD9A;&#xD9A;&#xDCA; download &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1;. &#xDB8;&#xDB8; XZ compressed source &#xD91;&#xD9A; download &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1;&#xDC0;&#xDCF;. &#xD8A;&#xDA7; &#xDB4;&#xDC3;&#xDCA;&#xDC3;&#xDD9; terminal &#xD91;&#xD9A;&#xDD9;&#xDB1;&#xDCA; download &#xD9A;&#xDBB;&#xDB4;&#xDD4; tar file &#xD91;&#xD9A; extract &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1;.</p>
<pre>
$ tar xvf ~/Downloads/Python-3.6.0.tar.xz
<i>... extract &#xDC0;&#xDD9;&#xDB1; file list &#xD91;&#xD9A; ...</i>
</pre>




                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ONPYTHON.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Python ගැන">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Python install කිරීම","level":"1.3","depth":1,"previous":{"title":"Python ගැන","level":"1.2","depth":1,"path":"ONPYTHON.md","ref":"ONPYTHON.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"INSTALL.md","mtime":"2016-12-26T05:43:00.066Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-12-26T13:50:50.464Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

