
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Python ගැන · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="INSTALL.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    හැඳින්වීම
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="ONPYTHON.html">
            
                <a href="ONPYTHON.html">
            
                    
                    Python ගැන
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="INSTALL.html">
            
                <a href="INSTALL.html">
            
                    
                    Python install කිරීම
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Python ගැන</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#xDB8;&#xDDC;&#xD9A;&#xDAF;&#xDCA;&#xDAF;-&#xDB8;&#xDDA;-python-&#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA;">&#xDB8;&#xDDC;&#xD9A;&#xDAF;&#xDCA;&#xDAF; &#xDB8;&#xDDA; python &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA;</h1>
<p>&#xDB8;&#xDDA; &#xD9A;&#xDDC;&#xDA7;&#xDC3;&#xDD9; &#xD9A;&#xDAD;&#xDCF; &#xD9A;&#xDBB;&#xDB1; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; &#xDAD;&#xDDA;&#xDBB;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD0;&#xDAD;&#xDD2;&#xDB1;&#xDB8;&#xDCA; &#xD92;&#xD9A; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDC1;&#xDCA;&#xDB1;&#xDBA;&#xD9A;&#xDCA; &#xD9A;&#xDBB;&#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xD91;&#xDB4;&#xDCF;. &#xDB8;&#xDDA; &#xDA7;&#xDD2;&#xD9A; &#xDB8;&#xD9C;&#xDC4;&#xDD0;&#xDBB;&#xDBD;&#xDCF; &#xD89;&#xDC3;&#xDCA;&#xDC3;&#xDBB;&#xDC4;&#xDA7; &#xDBA;&#xDB1;&#xDCA;&#xDB1;.</p>
<p>Python &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDD2;&#xDAD; (interpreted) &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBD;&#xDDA;&#xD9B;&#xDB1; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;&#xD9A;&#xDCA;. &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBD;&#xDDA;&#xD9B;&#xDB1; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC0;&#xDD2;&#xDA0;&#xDCA;&#xDA0;&#xDD2; &#xD9A;&#xDBB;&#xDBD;&#xDCF; &#xDAD;&#xDB8;&#xDBA;&#xDD2; &#xD85;&#xDB4;&#xDD2; &#xDB4;&#xDBB;&#xDD2;&#xD9C;&#xDAB;&#xD9A;&#xDBA;&#xDA7; &#xDBA;&#xDB8;&#xDCA; &#xD9A;&#xDCF;&#xDBB;&#xDCA;&#xDBA;&#xDBA;&#xD9A;&#xDCA; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xD8B;&#xDB4;&#xDAF;&#xDD9;&#xDC3;&#xDCA; &#xDAF;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9;. &#xDC4;&#xDD0;&#xDB6;&#xDD0;&#xDBA;&#xDD2; &#xDB4;&#xDBB;&#xDD2;&#xD9C;&#xDAB;&#xD9A;&#xDBA;&#xDA7; &#xD85;&#xDB4;&#xDD2; &#xDB8;&#xDDA; &#xDBD;&#xDD2;&#xDBA;&#xDB1; &#xDAF;&#xDDA;&#xDC0;&#xDBD;&#xDCA; &#xD9A;&#xDD9;&#xDBD;&#xDD2;&#xDB1;&#xDCA;&#xDB8; &#xD9A;&#xDD2;&#xDBA;&#xDC0;&#xDB1;&#xDCA;&#xDB1; &#xDB6;&#xDD1;. &#xD9A;&#xDDC;&#xDA7;&#xDD2;&#xDB1;&#xDCA;&#xDB8; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA; &#xDC3;&#xDD2;&#xDBA; &#xD9C;&#xDCF;&#xDAB;&#xD9A; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDB8;&#xDBD;&#xDDA;&#xD9B;&#xDB1; &#xDB7;&#xDCF;&#xDC2;&#xDCF; &#xDAD;&#xDD2;&#xDB6;&#xDD4;&#xDB1;&#xDAD;&#xDCA; &#xDB4;&#xDBB;&#xDD2;&#xD9C;&#xDAB;&#xD9A;&#xDBA;&#xDA7; &#xD92; &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDC0;&#xDAD;&#xDCA; &#xDAD;&#xDDA;&#xDBB;&#xDD4;&#xDB8;&#xDCA; &#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB6;&#xDD1;. &#xD92; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xD85;&#xDB4;&#xDD2; program &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDBD;&#xDD2;&#xDBA;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA;, &#xD85;&#xDB4;&#xDD2;&#xDA7; &#xD9A;&#xDD0;&#xDB8;&#xDAD;&#xDD2; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;&#xD9A;&#xDD2;&#xDB1;&#xDCA; &#xD92;&#xD9A; &#xDBD;&#xDD2;&#xDBA;&#xDBD;&#xDCF;, &#xDBA;&#xDB8;&#xDCA; &#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDB1;&#xDBA;&#xD9A;&#xDCA; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD9;&#xDB1;&#xDC0;&#xDCF;, &#xD92; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDD9; compile &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD9;&#xDB1;&#xDC0;&#xDCF;. compile &#xD9A;&#xDBB;&#xDAF;&#xDCA;&#xDAF;&#xDD2; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xD85;&#xDB4;&#xDD2; &#xD89;&#xD82;&#xD9C;&#xDCA;&#x200D;&#xDBB;&#xDD3;&#xDC3;&#xDD2; &#xD85;&#xD9A;&#xDD4;&#xDBB;&#xDD2;&#xDB1;&#xDCA; &#xDBD;&#xDD2;&#xDBA;&#xDB4;&#xDD4; codes &#xDB4;&#xDBB;&#xDD2;&#xD9C;&#xDAB;&#xD9A;&#xDA7; &#xDAD;&#xDDA;&#xDBB;&#xDD4;&#xDB8;&#xDCA; &#xD9C;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xD91;&#xD9A;&#xDB8; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0; &#xDC0;&#xDD9;&#xDB1; (binary codes &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDC4;&#xDB3;&#xDD4;&#xDB1;&#xDCA;&#xDC0;&#xDB1;) 0 &#xDC3;&#xDC4; 1 &#xD92;&#xDC0;&#xDCF; &#xD9C;&#xDDC;&#xDA9;&#xD9A;&#xDA7; (&#xDC0;&#xDD9;&#xDB1;&#xDB8; file &#xD91;&#xD9A;&#xD9A;&#xDA7; &#xDB8;&#xDDA;&#xDC0;&#xDCF; &#xDBD;&#xDD2;&#xDBA;&#xDD0;&#xDC0;&#xDD9;&#xDB1;&#xDC0;&#xDCF;) &#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDB1;&#xDBA; &#xDC0;&#xDD9;&#xDB1; &#xD91;&#xD9A;. &#xDB8;&#xDDA; 0 &#xDC3;&#xDC4; 1 &#xD92;&#xDC0;&#xDCF; &#xDBD;&#xDD2;&#xDBA;&#xDD0;&#xDC0;&#xDD9;&#xDB1; file &#xD91;&#xD9A; &#xDAD;&#xDB8;&#xDBA;&#xDD2; Windows &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xDB1;&#xDB8;&#xDCA; <code>.exe</code><sup><a href="#fn_1" id="reffn_1">1</a></sup> file &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xDC4;&#xDB3;&#xDD4;&#xDB1;&#xDCA;&#xDC0;&#xDB1;&#xDCA;&#xDB1;&#xDD9;.</p>
<p>&#xDB8;&#xDD9;&#xDC4;&#xDD9;&#xDB8; compile &#xD9A;&#xDBB;&#xDB4;&#xDD4; program &#xD91;&#xD9A;&#xD9A; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xDB4;&#xDCA;&#x200D;&#xDBB;&#xDC1;&#xDCA;&#xDB1;&#xDD9; &#xDAD;&#xDB8;&#xDBA;&#xDD2; &#xD92;&#xD9A; compile &#xD9A;&#xDBD;&#xDDA; Windows &#xDC0;&#xDBD;&#xDAF;&#xDD2; &#xDB1;&#xDB8;&#xDCA; &#xD92;&#xD9A; run<sup><a href="#fn_2" id="reffn_2">2</a></sup> &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF; &#xDB1;&#xDB8;&#xDCA; Windows &#xDC0;&#xDBD;&#xDB8; run &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDC0;&#xDD3;&#xDB8;. &#xD92; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xD92; program &#xD91;&#xD9A; Linux &#xDC0;&#xDBD;&#xDAF;&#xDD2; run &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB6;&#xDD1; (&#xD91;&#xDC4;&#xDD9;&#xDB8; &#xD95;&#xDB1;&#xDD9; &#xDB1;&#xDB8;&#xDCA; Linux &#xDC0;&#xDBD;&#xDA7; &#xD9C;&#xDD0;&#xDBD;&#xDB4;&#xDD9;&#xDB1; &#xDC0;&#xDD2;&#xDAF;&#xDD2;&#xDC4;&#xDA7; compile &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xD95;&#xDB1;&#xDD9;.)</p>
<p>Python &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDDA; &#xDB8;&#xDD9;&#xDC4;&#xDD9;&#xDB8; compile &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;&#xD9A;&#xDCA; (&#xDC3;&#xDB8;&#xDCA;&#xDB4;&#xDD6;&#xDBB;&#xDCA;&#xDAB; compile &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;&#xD9A;&#xDCA;) &#xD85;&#xDC0;&#xDC1;&#xDCA;&#x200D;&#xDBA; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD0;&#xDAD;&#xDD2; &#xDB7;&#xDCF;&#xDC2;&#xDCF;&#xDC0;&#xD9A;&#xDCA;. python &#xDC0;&#xDBD;&#xDAF;&#xDD2; compile &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;&#xD9A;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDC0;&#xDCF;, &#xDC4;&#xDD0;&#xDB6;&#xDD0;&#xDBA;&#xDD2; &#xD92; compile &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1;&#xDD9; compiler &#xD91;&#xD9A;&#xD9A;&#xDCA; &#xDB1;&#xDD9;&#xDB8;&#xDD9;&#xDBA;&#xDD2;, interpreter &#xD91;&#xD9A;&#xD9A;&#xDCA;. Interpreter &#xD91;&#xD9A; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1;&#xDD9; program &#xD91;&#xD9A;&#xDDA; &#xD91;&#xD9A;&#xDCA; &#xD91;&#xD9A;&#xDCA; &#xDC0;&#xDD2;&#xDB0;&#xDCF;&#xDB1;&#xDBA; binary code &#xD91;&#xD9A;&#xDA7; &#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDB1;&#xDBA; &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;. &#xDB8;&#xDDA; &#xDC0;&#xDD0;&#xDA9;&#xDDA; &#xDC3;&#xDD2;&#xDAF;&#xDCA;&#xDB0; &#xDC0;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; program &#xD91;&#xD9A; run &#xDC0;&#xDD9;&#xDB1; &#xDB8;&#xDDC;&#xDC4;&#xDDC;&#xDAD;&#xDDA;&#xDAF;&#xDD3;&#xDB8; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDC0;&#xDD9;&#xDB1;&#xDB8; compile &#xD9A;&#xDD2;&#xDBB;&#xDD3;&#xDB8;&#xD9A;&#xDCA; &#xDB4;&#xDD9;&#xDB1;&#xDD9;&#xDB1;&#xDCA;&#xDB1;&#xDD9; &#xDB1;&#xDD1;. program &#xD91;&#xD9A; run &#xDC0;&#xDD9;&#xDB1; &#xDB8;&#xDDC;&#xDC4;&#xDDC;&#xDAD;&#xD9A;&#xDCA; &#xDB4;&#xDCF;&#xDC3;&#xDCF; &#xDB8;&#xDDA; &#xDB4;&#xDBB;&#xDD2;&#xDC0;&#xDBB;&#xDCA;&#xDAD;&#xDB1;&#xDBA; &#xDC3;&#xDD2;&#xDAF;&#xDCA;&#xDB0; &#xDC0;&#xDD9;&#xDB1; &#xDB1;&#xDD2;&#xDC3;&#xDCF; &#xDC3;&#xDB8;&#xDC4;&#xDBB; &#xDC0;&#xDD2;&#xDA7; &#xDB8;&#xDDA;&#xD9A; &#xD9A;&#xDCF;&#xDBD;&#xDD9; &#xDB1;&#xDCF;&#xDC3;&#xDCA;&#xDAD;&#xDD2;&#xDBA;&#xD9A;&#xDCA; &#xDC0;&#xD9C;&#xDDA; &#xDB4;&#xDDA;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA;. &#xD92;&#xDAD;&#xDCA; &#xDB8;&#xDDA;&#xD9A;&#xDD9; &#xDAD;&#xDD2;&#xDBA;&#xDD9;&#xDB1; &#xDC0;&#xDCF;&#xDC3;&#xDD2;&#xDBA; &#xDAD;&#xDB8;&#xDBA;&#xDD2; Windows &#xDC0;&#xDBD; &#xDC0;&#xD9C;&#xDDA;&#xDB8; linux &#xDC0;&#xDBD;&#xDAD;&#xDCA;, Mac &#xDC0;&#xDBD;&#xDAD;&#xDCA; &#xD91;&#xD9A;&#xDB8; code &#xD91;&#xD9A; &#xD9A;&#xDD2;&#xDC3;&#xDD2;&#xDB8; &#xDC0;&#xDD9;&#xDB1;&#xDC3;&#xD9A;&#xDCA; &#xDB1;&#xDD0;&#xDAD;&#xDD4;&#xDC0; run &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1; &#xDB4;&#xDD4;&#xDC5;&#xDD4;&#xDC0;&#xDB1;&#xDCA; &#xDC0;&#xDD3;&#xDB8;. </p>
<p>Python interpreter &#xD91;&#xD9A; install &#xD9A;&#xDBB;&#xD9C;&#xDD0;&#xDB1;&#xDD3;&#xDB8; &#xD9C;&#xDD0;&#xDB1; &#xDC0;&#xDD2;&#xDC3;&#xDCA;&#xDAD;&#xDBB; &#xD8A;&#xDBD;&#xD9F; &#xDB4;&#xDBB;&#xDD2;&#xDA0;&#xDCA;&#xDA1;&#xDDA;&#xDAF;&#xDBA;&#xDD9; &#xDC3;&#xDB3;&#xDC4;&#xDB1;&#xDCA; &#xDC0;&#xDD9;&#xDB1;&#xDC0;&#xDCF;.</p>
<hr>
<blockquote id="fn_1">
<sup>1</sup>. <code>exe</code> &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDD9; <em>executable</em> &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xD91;&#xD9A;.<a href="#reffn_1" title="Jump back to footnote [1] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_2">
<sup>2</sup>. <span>&#x201C;run&#x201D;</span> &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF; &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xD91;&#xD9A;&#xDD9;&#xDB1;&#xDCA; &#xDB8;&#xDB8; &#xD85;&#xDAF;&#xDC4;&#xDC3;&#xDCA; &#xD9A;&#xDBB;&#xDB1;&#xDCA;&#xDB1;&#xDD9; program &#xD91;&#xD9A; &#xD9A;&#xDCA;&#x200D;&#xDBB;&#xDD2;&#xDBA;&#xDCF;&#xDAD;&#xDCA;&#xDB8;&#xD9A; &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF; &#xD9A;&#xDD2;&#xDBA;&#xDB1; &#xD91;&#xD9A;. <span>&#x201C;execute&#x201D;</span> &#xD9A;&#xDBB;&#xDB1;&#xDC0;&#xDCF; &#xD9A;&#xDD2;&#xDBA;&#xDBD;&#xDCF; &#xD9A;&#xDD2;&#xDBA;&#xDB1;&#xDCA;&#xDB1;&#xDD9;&#xDAD;&#xDCA; &#xDB8;&#xDDA;&#xD9A;&#xDA7;<a href="#reffn_2" title="Jump back to footnote [2] in the text."> &#x21A9;</a>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: හැඳින්වීම">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="INSTALL.html" class="navigation navigation-next " aria-label="Next page: Python install කිරීම">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Python ගැන","level":"1.2","depth":1,"next":{"title":"Python install කිරීම","level":"1.3","depth":1,"path":"INSTALL.md","ref":"INSTALL.md","articles":[]},"previous":{"title":"හැඳින්වීම","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ONPYTHON.md","mtime":"2016-12-25T15:02:20.214Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-12-26T13:50:50.464Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

